<?php

use yii\db\Migration;

/**
 * Class m190920_205147_createTable_region_and_inserts
 */
class m190920_205147_createTable_region_and_inserts extends Migration
{
    use \console\traits\DbTableConfigurator;

    /**
     * Дополнительные параметры таблиц БД.
     *
     * @var $tableOptions string
     */
    private $tableOptions;

    /**
     * {@inheritdoc}
     */
    public function init()
    {
        parent::init();
        $this->tableOptions = $this->getOptions($this->db->driverName);
    }

    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('{{%region}}', [
            '[[id]]'                    => $this->primaryKey()->notNull(),
            '[[name]]'                  => $this->string(255)." COMMENT 'Название'",
            '[[created]]'               => $this->dateTime()." COMMENT 'Дата и время добавления'",
            '[[updated]]'               => $this->dateTime()." COMMENT 'Дата и время обновления'",
        ], $this->tableOptions);

        $regions = [
            'Чувашская Республика',
            'Алтайский край',
            'Краснодарский край',
            'Красноярский край',
            'Приморский край',
            'Ставропольский край',
            'Хабаровский край',
            'Амурская область',
            'Архангельская область',
            'Астраханская область',
            'Белгородская область',
            'Брянская область',
            'Владимирская область',
            'Волгоградская область',
            'Вологодская область',
            'Воронежская область',
            'Ивановская область',
            'Иркутская область',
            'Калининградская область',
            'Калужская область',
            'Камчатский край',
            'Кемеровская область',
            'Кировская область',
            'Костромская область',
            'Курганская область',
            'Курская область',
            'Ленинградская область',
            'Липецкая область',
            'Магаданская область',
            'Московская область',
            'Мурманская область',
            'Нижегородская область',
            'Новгородская область',
            'Новосибирская область',
            'Омская область',
            'Оренбургская область',
            'Орловская область',
            'Пензенская область',
            'Пермский край',
            'Псковская область',
            'Ростовская область',
            'Рязанская область',
            'Самарская область',
            'Саратовская область',
            'Сахалинская область',
            'Свердловская область',
            'Смоленская область',
            'Тамбовская область',
            'Тверская область',
            'Томская область',
            'Тульская область',
            'Тюменская область',
            'Ульяновская область',
            'Челябинская область',
            'Забайкальский край',
            'Ярославская область',
            'Москва',
            'Санкт-Петербург',
            'Еврейская автономная область',
            'Ненецкий автономный округ',
            'Ханты-Мансийский автономный округ',
            'Чукотский автономный округ',
            'Ямало-Ненецкий автономный округ',
            'Республика Крым',
            'Севастополь',
        ];

        foreach ($regions as $region) {
            $this->insert('region', ['name' => $region, 'updated' => date('Y-m-d H:i:s'), 'created' => date('Y-m-d H:i:s'),]);
        }

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m190920_205146_createTable_region cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m190920_205146_createTable_region cannot be reverted.\n";

        return false;
    }
    */
}
